// 智慧工业园区

/**
 * 左边模块
 */

export const iconlist = [
  '企业列表','风险管控','重大危险源','特殊作业','物流管理','通讯录','国家政策','行政审批'
]

// 安全指数趋势
export const safetyIndex = {
  date: ['1h','2h','3h','4h','5h','6h','7h','8h','9h','10h','11h','12h','13h','14h','15h'],
  value: [20,40,50,45,43,50,55,80,10,10,50,60,70,88,82]
}

// 安全隐患分布
export const hiddenDanger = [
  {
    name: '设备隐患',
    value: 63
  },
  {
    name: '电器隐患',
    value: 18
  },
  {
    name: '消费应急',
    value: 15
  },
  {
    name: '安全隐患',
    value: 4
  },
]

// 重点安全监管企业
export const riskDesc = [
  '低风险','一般风险','高风险','重大风险'
]
export const companyList = [
  {
    name: '迈克生物股份有限公司',
    risk: 0,
    point: 95,
  },
  {
    name: '阳光太阳能工程有限公司',
    risk: 2,
    point: 80,
  },
  {
    name: '浩恩医药耗材有限公司',
    risk: 1,
    point: 86,
  },
  {
    name: '佳新材料股份有限公司',
    risk: 3,
    point: 75,
  },
  {
    name: '求是生物股份有限公司',
    risk: 0,
    point: 95,
  },
]

/**
 * 中间模块
 */
export const enterprise = [
  {
    name: '企业总数',
    color: '#FFF',
    val: 128,
  },
  {
    name: '危险源企业',
    color: '#FF4A31;',
    val: 43
  },
  {
    name: '园区企业类型',
    data: [
      {
        name: '化工企业',
        value: 69
      },
      {
        name: '制药企业',
        value: 25
      },
      {
        name: '其他',
        value: 18
      },
      {
        name: '新材料企业',
        value: 26
      },
    ]
  }
]
export const pointsName = [
  '园区人员','检测设备','隐患','报警','举报数量','物流车辆'
]

export const points = [
  [3450,4620,233,87,45,1423],
  [3450,4620,233,88,45,1425],
  [3450,4620,231,88,45,1428],
  [3450,4620,231,88,45,1430],
  [3450,4620,235,88,45,1431],
  [3450,4620,235,90,45,1435],
  [3450,4620,235,90,45,1436],
  [3450,4620,229,91,46,1437],
  [3450,4620,229,91,46,1438],
  [3450,4620,228,94,46,1439],
  [3450,4620,228,94,46,1441],
  [3450,4620,231,94,46,1445],
  [3450,4620,231,90,49,1450],
  [3450,4620,231,90,49,1451],
  [3450,4620,237,90,49,1453],
  [3450,4620,237,89,49,1454],
  [3450,4620,237,89,49,1457],
  [3450,4620,237,89,49,1458],
  [3450,4620,234,88,49,1461],
  [3450,4620,233,88,49,1463],
]
// 中间图上对应的位置点
export const posList = [
  {
    type: 'red',
    top: 679,
    left: 175,
  },
  {
    type: 'red',
    top: 560,
    left: 204,
  },
  {
    type: 'yellow',
    top: 590,
    left: 293,
  },
  {
    type: 'yellow',
    top: 687,
    left: 331,
  },
  {
    type: 'green',
    top: 707,
    left: 624,
  },
  {
    type: 'red',
    top: 496,
    left: 666,
    data: [
      {
        name: '安全风险指数',
        val: 95,
        color: '#7BF663'
      },
      {
        name: '安全隐患数量',
        val: 10,
        color: '#7BF663'
      },
      {
        name: '环保指数',
        val: 150,
        color: '#FF4A31'
      },
    ]
  },
  {
    type: 'green',
    top: 717,
    left: 735,
  },
  {
    type: 'yellow',
    top: 550,
    left: 902,
  }
]

/**
 * 右边模块
 */

export const airQuality = [
  [87,25,40,23,13,25],
  [88,20,35,22,14,25],
  [89,19,36,22,14,23],
  [88,21,35,21,16,24],
  [87,23,38,22,14,23],
]